Autodesk.Revit.DB.Lighting.InitialIntensity.Clone
Creates a copy of the InitialIntensity derived object.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialIntensity.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Lighting.InitialIntensity.InitialIntensityValue
The calculated initial intensity value.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialIntensity
This class is the base class for calculating lighting initial intensity.
Since:
2013